README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline4">1. Udacity FSWDN Course Project 1</a>
<ul>
<li><a href="#orgheadline1">1.1. How To Run</a></li>
<li><a href="#orgheadline2">1.2. How To Download</a></li>
<li><a href="#orgheadline3">1.3. All in Good Fun</a></li>
</ul>
</li>
</ul>
</div>
</div>

# Udacity FSWDN Course Project 1<a id="orgheadline4"></a>

## How To Run<a id="orgheadline1"></a>

The main program here, which must be run by python itself, is
`entertainment_center.py`. 

When run (say by calling from the command line, running from IDLE or
calling from the python interpreter), this file generates a page of
HTML and opens up that page in the user's web browser.

`entertainment_center.py` relies on `fresh_tomatoes.py` for all its
magic code generation.

Minor (genetic) modifications have been made to [`fresh_tomatoes.py`](https://github.com/adarsh0806/ud036_StarterCode/blob/master/fresh_tomatoes.py) to
also display a (slightly stylized) generic movie tagline (that has
virtually nothing to do with the movies).

## How To Download<a id="orgheadline2"></a>

Clone this file using github or click the `download.zip` button above
to download the program source code.

## All in Good Fun<a id="orgheadline3"></a>

This site should not be confused with a helpful, informative movie
website. It should instead be considered a vaguely
surrealist/sophmoric take on the required programming specifications.
